feat: profile improvements
